Wika-Group-IIoT-RD/mcuboot/boot/stm32/src/boot_log_uart.c
#include "stm32wlxx_hal.h"
#include "bootutil_log.h"
#include <stdarg.h>
#include <stdio.h>
#include <string.h>

extern UART_HandleTypeDef hlpuart1;

#define TIMEOUT_500_MS		500

static void boot_log_uart_send(const char *prefix, const char *msg, va_list args) {
    char buffer[MAX_UART_BUFFER];
    int len = snprintf(buffer, sizeof(buffer), "\r\n[%s] ", prefix);
    vsnprintf(buffer + len, sizeof(buffer) - len, msg, args);


    if (HAL_UART_GetState(&hlpuart1) == HAL_UART_STATE_READY) {
        HAL_UART_Transmit(&hlpuart1, (uint8_t *)buffer, strlen(buffer), TIMEOUT_500_MS);
    }
}

void boot_log_info(const char *msg, ...)
{
    va_list args;
    va_start(args, msg);
    boot_log_uart_send("INFO", msg, args);
    va_end(args);
}



void boot_log_err(const char *msg, ...)
{
    va_list args;
    va_start(args, msg);
    boot_log_uart_send("ERR", msg, args);
    va_end(args);
}

void boot_log_warn(const char *msg, ...)
{
    va_list args;
    va_start(args, msg);
    boot_log_uart_send("WARN", msg, args);
    va_end(args);
}

void boot_log_debug(const char *msg, ...)
{
    va_list args;
    va_start(args, msg);
    boot_log_uart_send("DBG", msg, args);
    va_end(args);
}
